#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dlnkalyaniorg/demo-github-actions/runs/run-ntdmGhreYKt6MbXU

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
random_id.server_PR_8: Refreshing state... [id=kqyDO5j58SA]
random_id.server: Refreshing state... [id=odE_1ewwkfI]
aws_key_pair.staging_key: Refreshing state... [id=staging-key]
aws_instance.staging_cicd_demo: Refreshing state... [id=i-0e53b04ba873e2c60]
aws_instance.staging_cicd_demo_PR_8: Refreshing state... [id=i-0f8c0448b68b309fd]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_instance.staging_cicd_demo has been deleted
  - resource "aws_instance" "staging_cicd_demo" {
        id                                   = "i-0e53b04ba873e2c60"
      - public_dns                           = "ec2-3-84-178-152.compute-1.amazonaws.com" -> null
        tags                                 = {
            "Name" = "staging_cicd_demo-a1d13fd5ec3091f2"
        }
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_instance.staging_cicd_demo_PR_8 has been deleted
  - resource "aws_instance" "staging_cicd_demo_PR_8" {
        id                                   = "i-0f8c0448b68b309fd"
      - public_dns                           = "ec2-204-236-207-69.compute-1.amazonaws.com" -> null
        tags                                 = {
            "Name" = "staging_cicd_demo-PR_8"
        }
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.staging_cicd_demo will be created
  + resource "aws_instance" "staging_cicd_demo" {
      + ami                                  = (sensitive value)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "staging-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "staging_cicd_demo-a1d13fd5ec3091f2"
        }
      + tags_all                             = {
          + "Name" = "staging_cicd_demo-a1d13fd5ec3091f2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0294f8ff7fb076a63",
        ]
    }

  # aws_instance.staging_cicd_demo_PR_8 will be created
  + resource "aws_instance" "staging_cicd_demo_PR_8" {
      + ami                                  = (sensitive value)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "staging-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "staging_cicd_demo-PR_8"
        }
      + tags_all                             = {
          + "Name" = "staging_cicd_demo-PR_8"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0294f8ff7fb076a63",
        ]
    }

  # aws_key_pair.staging_key must be replaced
-/+ resource "aws_key_pair" "staging_key" {
      ~ arn             = "arn:aws:ec2:us-east-1:278882023872:key-pair/staging-key" -> (known after apply)
      ~ fingerprint     = "9a:81:7b:3b:c0:29:95:83:e3:f1:5a:25:cc:6a:2d:06:b3:97:a5:77" -> (known after apply)
      ~ id              = "staging-key" -> (known after apply)
      + key_name_prefix = (known after apply)
      ~ key_pair_id     = "key-08a41ca9252a543ad" -> (known after apply)
      ~ public_key      = (sensitive value) # forces replacement
      ~ tags            = {
          + "Name" = "staging_public_key"
        }
      ~ tags_all        = {
          + "Name" = "staging_public_key"
        }
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ staging_dns      = "ec2-3-84-178-152.compute-1.amazonaws.com" -> (known after apply)
  ~ staging_dns_PR_8 = "ec2-204-236-207-69.compute-1.amazonaws.com" -> (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "REMOTE_USER" but a value
│ was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-ntdmGhreYKt6MbXU/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @dlnkalyani, Action: `workflow_dispatch`*